Repository: mmrm11/48764011D
Catalog: omegat/project_save.tmx
Source language: en
Languages: es_es

source: Some youths would share secrets and inner feelings freely with their peers since they would be comfortable exposing their body problems to friends as opposed to parents.
es_es: Algunos jóvenes compartirían sus secretos y sentimientos íntimos libremente con sus compañeros, ya que se sentirían más cómodos exponiendo sus problemas corporales a sus amigos que a sus padres.

source: Staring from the age of six, modern girls experience a desire to be thin and start dieting at seven years (Northup & Liebler, 2010).
es_es: Desde los seis años, las niñas modernas experimentan el deseo de estar delgadas y empiezan a hacer dieta a los siete años (Northup y Liebler, 2010).

source: Students within campus would influence one of the group members to be slim, by forfeiting food.
es_es: Los estudiantes que vivían dentro del campus influían en uno de los miembros del grupo para que estuviera delgado, privándole de comer.

source: Studies in the US and Europe suggest that the family plays a critical role as far as educating children on the best diet is concerned (Attie, & Brooks-Gunn, 1989).
es_es: Estudios realizados en EE.UU. y Europa afirman que la familia desempeña un papel fundamental en lo que respecta a la educación de los niños sobre una mejor dieta (Attie, & Brooks-Gunn, 1989).

source: Studies show that children would probably develop varying attitudes regarding their bodies at a tender age.
es_es: Los estudios demuestran que es probable que los niños desarrollen distintas actitudes con respecto a su cuerpo a una edad temprana.

source: Such children would frequently share information regarding intimacy and companionship.
es_es: Estos niños compartirían con frecuencia información relativa a la intimidad y el compañerismo.

source: Such self-perception as objects of physical attractiveness and desire provoke sexual stereotypes and wrong life values (Clark, & Tiggemann, 2006).
es_es: Esa autopercepción como objetos de atractivo físico y deseo, causa estereotipos sexuales y valores vitales erróneos (Clark, & Tiggemann, 2006).

source: Television, cinema, radio, the internet, and print media affect young people’s understanding of their own bodies and the standards they should try to achieve in terms of physical beauty.
es_es: La televisión, el cine, la radio, Internet y los medios impresos afectan a la comprensión de los jóvenes de su propio cuerpo y de los estándares que deben tratar de alcanzar en términos de belleza física.

source: Television, radio, and advertising are probably the major media manifestations present in a rich diversity.
es_es: La televisión, la radio y la publicidad son probablemente las principales manifestaciones mediáticas que encontramos hoy en día con una rica diversidad.

source: The Influence of the Family
es_es: La influencia de la familia

source: The ability to comprehend and store information is a key factor for the observational learning.
es_es: La capacidad de comprender y almacenar información es un factor clave para el aprendizaje observacional.

source: The above scholar found out that girls consider mothers and same-sex peers to be role models, and they would try to emulate any figure possessed by such role models.
es_es: El citado estudioso descubrió que las chicas consideran a las madres y a los compañeros del mismo sexo como modelos de conducta, e intentarían emular cualquier figura que poseyeran dichos modelos.

source: The above scholars concluded their study by observing that older girls received much pressure from their friends to maintain certain body figures.
es_es: Los estudiosos citados concluyeron su estudio observando que las chicas mayores recibían mucha presión de sus amigos para mantener determinadas figuras corporales.

source: The above-mentioned peer components were found to influence dieting and would perhaps affect the eating behaviors, as well as the self-esteem of students.
es_es: Se descubrió que los componentes de los compañeros mencionados influyen en las dietas y tal vez afecten a las conductas alimentarias, así como a la autoestima de las estudiantes.

source: The behavior provokes two main physical consequences, which are closely connected with children’s psychological condition.
es_es: El comportamiento provoca principalmente, dos consecuencias psicológicas, que están altamente relacionadas con la condición psicológica de los niños.

source: The bulimic behavior could only be investigated by considering whether a student resided within the campus premises or went home after classes.
es_es: gEl comportamiento bulímico sólo pudo investigarse teniendo en cuenta si el estudiante residía dentro de las instalaciones del campus o se iba a casa después de las clases.

source: The contemporary media address all the stated above aspects; it provides fascinating content catching children’s attention in the way to make it clear and understandable by children.
es_es: Los medios de comunicación contemporáneos abordan todos los aspectos anteriores; ofrecen contenidos fascinantes que captan la atención de los niños de forma que resulten claros y comprensibles para ellos.

source: The content of the contemporary media emphasizes the importance of physical attractiveness among both boys and girls.
es_es: El contenido de los medios de comunicación contemporáneos subraya la importancia del atractivo físico tanto entre los chicos como entre las chicas.

source: The current society does not encourage fatness among women hence mothers would try to prevent their daughters from intimidation by urging them to control their diets.
es_es: La sociedad actual no fomenta la gordura entre las mujeres, de ahí que las madres intentaran evitar la intimidación de sus hijas instándolas a controlar su dieta.

source: The development of the self in girls is influenced by the mother-daughter relationship.
es_es: El desarrollo de las niñas está influido por la relación madre-hija.

source: The discussion suggests that socio-cultural and psychosomatic components affect the development of children.
es_es: La discusión sugiere que los componentes socioculturales y psicosomáticos afectan al desarrollo de los niños.

source: The establishment of relationships among peers may perhaps influence self-perceptions pertaining to body images and self-competences.
es_es: El establecimiento de relaciones entre iguales puede quizá influir en las autopercepciones relativas a la imagen corporal y las autocompetencias.

source: The family has always had a tremendous effect on the growth and development of the child.
es_es: La familia siempre ha tenido un efecto enorme en el crecimiento y desarrollo del niño.

source: The family is often considered a primary socializing agent implying that it is responsible for shaping the behavior of an individual at an early age, including the body image.
es_es: La familia suele considerarse un agente socializador primario, lo que implica que es responsable de moldear el comportamiento de un individuo a una edad temprana, incluida la imagen corporal.

source: The family is usually the primary socializing agent and is expected to affect the child in many ways as compared to the peer, media, and other socializing agents.
es_es: La familia suele ser el principal agente socializador y se espera que afecte al niño de muchas maneras en comparación con los compañeros, los medios de comunicación y otros agentes socializadores.

source: The family would frequently teach children to use the best nutritional practices, as well as employ proper dietary practices.
es_es: La familia suele enseñar a los niños a utilizar las mejores prácticas nutricionales, así como a emplear prácticas dietéticas adecuadas.

source: The fashion industry has produced and popularized a vast amount of “the physically impossible, tall, thin, and busty Barbie-doll stereotype” models like Claudia Schiffer and Elle MacPherson (Grogan, 1998, p.
es_es: La industria de la moda ha producido y popularizado una gran cantidad de modelos "del estereotipo de la muñeca Barbie, físicamente imposible, alta, delgada y pechugona", como Claudia Schiffer y Elle MacPherson (Grogan, 1998, p.

source: The findings by above scholars indicated that mothers wanted their daughters to be thinner as compared to other girls in society.
es_es: Las conclusiones de los investigadores mencionados, indicaban que las madres quieren que sus hijas estén más delgadas en comparación con otras chicas de la sociedad.

source: The findings in Australia were close to the findings in Canada since friendship attitudes were believed to influence the body image of children, especially eating behavior and dietary expression.
es_es: Los hallazgos en Australia se aproximaban a los de Canadá, ya que se creía que las actitudes hacia la amistad influían en la imagen corporal de los niños, especialmente en la conducta alimentaria y la expresión de la dieta.

source: The findings of Mukai were consistent with the postulations of psychological adjustment theory, which states that older adolescent girls tend to interact more with their peers as opposed to young adolescents.
es_es: Las conclusiones de Mukai concuerdan con las postulaciones de la teoría de la adaptación psicológica, según la cual las adolescentes de más edad tienden a relacionarse más con sus iguales que las adolescentes jóvenes.

source: The findings suggest that the socializing agents affect girls and boys differently.
es_es: Los resultados sugieren que los agentes socializadores afectan de forma diferente a las niñas y a los niños.

source: The first involves an actual person demonstrating some behavioral traits; the second is applied to fictional or real characters acting out behaviors in films, TV shows, or books.
es_es: El primero implica que una persona real demuestre algunos rasgos de comportamiento; el segundo se aplica a personajes ficticios o reales que representan comportamientos en películas, programas de televisión o libros.

source: The great role on forming children’s perception of society and its values is done by children’s TV shows, films, and animated movies.
es_es: Los programas de televisión, las películas y los dibujos animados infantiles desempeñan un papel fundamental en la formación de la percepción que los niños tienen de la sociedad y sus valores.

source: The ideal man should have broad shoulders, narrow waist, and muscular arms, legs, stomach, and chest.
es_es: El hombre ideal debe tener hombros anchos, cintura estrecha y brazos, piernas, estómago y pecho musculosos.

source: The impact produced by the television content is significant; however, it is obvious that it is much greater in the context of children and teenagers who learn a considerable amount of information and are acquainted with society through the television.
es_es: El impacto producido por los contenidos televisivos es desmesurado; sin embargo, es evidente que es mucho mayor en el contexto de los niños y adolescentes, que aprenden una cantidad considerable de información y se familiarizan con la sociedad a través de la televisión.

source: The investigation of Bandura’s Social Learning Theory allows asserting that its principles advocate for significant impact produced by media on children.
es_es: La investigación de la Teoría del Aprendizaje Social de Bandura permite afirmar que sus principios abogan por un impacto significativo producido por los medios de comunicación en los niños.

source: The issue of body image is most acute for adolescents whose pubertal development results in physical changes.
es_es: El problema de la imagen corporal afecta a adolescentes cuyo desarrollo en la adolescencia resulta en cambios físicos.

source: The issue of body image, its impact on women’s life styles, and the perception of female beauty have been a popular topic since the second part of the twentieth century.
es_es: El problema de la imagen corporal, es el impacto en el estilo de vida de las mujeres, y la percepción de la belleza femenina ha sido un tema muy popular desde la segunda mitad del siglo XX.

source: The main concepts of Bandura’s Social Learning Theory comprise the assumptions that people learn through observations; internal mental state makes its contribution to the process, and learnt information does not result in a behavioral change.
es_es: Los principales conceptos de la Teoría del Aprendizaje Social de Bandura comprenden los supuestos de que las personas aprenden a través de observaciones; el estado mental interno contribuye al proceso, y la información aprendida no da lugar a un cambio de comportamiento.

source: The main impact is considered to be produced by TV shows promoting beauty as a symbol of success and establishing particular beauty standards.
es_es: Se considera que el principal impacto lo producen los programas de televisión que promueven la belleza como símbolo de éxito y establecen determinados cánones de belleza.

source: The major illustration of the standards of body beauty promoted by the modern media is fashion models.
es_es: La mayor ilustración de los estándares de belleza corporal promovidos por los medios de comunicación modernos son las modelos de moda.

source: The majority of girls starting from the age of nine think they are overweight.
es_es: La mayoría de las niñas a partir de los nueve años piensan que tienen sobrepeso.

source: The media portray some human features to be of value as compared to others.
es_es: Las redes sociales retratan algunos rasgos humanos como mejor valorados en comparación con otros.

source: The most popular and consumed kind of media among children is television due to easy access to it (Kater, Rohwer, & Londre, 2002).
es_es: El medio más popular y consumido por los niños es la televisión, debido a su fácil acceso (Kater, Rohwer & Londre, 2002).

source: The most prominent accomplishment in this field is the Social Learning Theory of Albert Bandura; thus, it is reasonable to examine its concepts in this work.
es_es: El logro más destacado en este campo es la Teoría del Aprendizaje Social de Albert Bandura. Por lo tanto, es sensato examinar sus conceptos en este trabajo.

source: The next-door girl character is a mixture of traditional femininity and athletics.
es_es: El personaje de la chica de al lado es una mezcla de feminidad tradicional y atletismo.

source: The overwhelming depiction of thin women and muscular men influences substantially children’s social behaviors, self-esteem levels, mood variables, and body satisfaction.
es_es: La abrumadora representación de mujeres delgadas y hombres musculosos influye sustancialmente en los comportamientos sociales, los niveles de autoestima, las variables del estado de ánimo y la satisfacción corporal de los niños.

source: The peer and the family are known to affect girls more as opposed to boys.
es_es: Se sabe que los compañeros y la familia afectan más a las chicas que a los chicos.

source: The peer would ensure that children comply with the requirements of beauty for them to be accepted.
es_es: Los iguales se asegurarían de que los niños cumplan los requisitos de belleza para que sean aceptados.

source: The performance of game characters is based on individual social-psychological models of self-concept and self-perception (Klimmt, Hefner, & Vorderer, 2009).
es_es: La actuación de los personajes de los juegos se basa en modelos sociopsicológicos individuales de autoconcepto y autopercepción (Klimmt, Hefner, & Vorderer, 2009).

source: The present trends regarding body image among children have been observed within centuries, and they continue to be true at the contemporary period despite the societal revolution that took place in the middle of the 20th century and marked the fundamental change in women’s perceptions regarding themselves.
es_es: Las tendencias actuales relativas a la imagen corporal entre los niños se han observado durante siglos, y siguen siendo ciertas en la época contemporánea a pesar de la revolución social que tuvo lugar a mediados del siglo XX y que marcó el cambio fundamental en la percepción que las mujeres tenían de sí mismas.

source: The rapid increase in body dissatisfaction rates at the dawn of the 21st century has attracted the attention of scientists, researchers, clinicians, and psychologists (Markey & Markey, 2010)… Negative body image contributes to different psychological and physical consequences such as dieting, obesity, anorexia, bulimia, and other extreme measures of weight and appearance control.
es_es: El aumento rápido en la insatisfacción corporal al comienzo del siglo 21 ha llamado la atención de los científicos, investigadores, médicos y psicólogos (Markey & Markey, 2010)... Una imagen corporal negativa contribuye a diferentes consecuencias psicológicas y físicas como hacer dieta, obesidad, bulimia y otras medidas extremas para controlar el peso y la apariencia.

source: The recent statistics from the mental journal indicate that the dramatic increase of children’s dissatisfaction with their bodies calls for investigations into the causes of such behavior.
es_es: Las estadísticas recientes de la revista mental indican que el aumento dramático de la insatisfacción de los niños con sus cuerpos exige que se investiguen las causas de tal comportamiento.

source: The research of Lawrie et al.
es_es: La investigación de Lawrie et al.

source: The research of Prabu, Boyne, and German (2009) discovered that weight difference does not provoke any purchase drop among the consumers.
es_es: La investigación de Prabu, Boyne y German (2009) descubrió que la diferencia de peso no provoca ningún descenso de compra entre los consumidores.

source: The researches show that children playing video games identify themselves with game characters through temporal adoption of their properties (Klimmt, Hefner, & Vorderer, 2009).
es_es: Las investigaciones demuestran que los niños que juegan a videojuegos se identifican con los personajes del juego mediante la adopción temporal de sus propiedades (Klimmt, Hefner y Vorderer, 2009).

source: The results of media influence on girls are extremely serious causing psychological and health disorders.
es_es: Los resultados de la influencia de los medios de comunicación en las niñas son extremadamente graves y provocan trastornos psicológicos y de salud.

source: The role models usually urge girls to embrace thinness since it is the accepted figure in women.
es_es: Los modelos de conducta suelen instar a las niñas a abrazar la delgadez, ya que es la figura aceptada en las mujeres.

source: The severity of body image consequences is essential to investigate media, family, and peer surrounding as the major factors of children’s obsession with the body perfection.
es_es: La severidad de las consecuencias de la imagen corporal es esencial investigar redes sociales, familia y compañeros cercanos como los mayores factores de la obsesión en los niños con la perfección corporal.

source: The situation worsens when the girl attains the adolescence age.
es_es: La situación empeora cuando la niña llega a la adolescencia.

source: The size and shape have been transformed in the contexts of health and attractiveness.
es_es: El tamaño y la forma se han transformado en contextos de salud y atractivo.

source: The stated above beauty categories reveal that contemporary media illustrates different kinds of female characters – beautiful kittens, smart career-builders, or those protesting against society.
es_es: Las categorías de belleza mencionadas revelan que los medios de comunicación contemporáneos ilustran distintos tipos de personajes femeninos: gatitas guapas, inteligentes emprendedoras o que protestan contra la sociedad.

source: The stated above information is sound evidence that the main message of the contemporary media is the issue of body image.
es_es: La información anterior es una prueba fehaciente de que el mensaje principal de los medios de comunicación contemporáneos es el tema de la imagen corporal.

source: The studies of various scholars discover that free access to the contemporary media resources, which encourage slim body beauty, results in both intentional and unintentional restrains of food consumption.
es_es: Los estudios de varios académicos descubren que el libre acceso a los recursos de los medios actuales, que fomentan la belleza del cuerpo delgado, da como resultado restricciones intencionales y no intencionales del consumo de alimentos.

source: The studies postulate that women would do anything to attain the ideal body figure, which is related to slimness.
es_es: Los estudios postulan que las mujeres harían cualquier cosa por alcanzar la figura corporal ideal, que está relacionada con la delgadez.

source: The studies related to body image among children suggest that thinness among women and masculinity among men are the desired qualities of a perfect person in society.
es_es: Los estudios relacionados con la imagen corporal entre los niños sugieren que la delgadez entre las mujeres y la masculinidad entre los hombres son las cualidades deseadas de una persona perfecta en la sociedad.

source: The study revealed that the need to be slim among girls resulted to various eating problems.
es_es: El estudio reveló que la necesidad de estar delgadas entre las chicas daba lugar a diversos problemas alimentarios.

source: The third Bandura’s concept claims that observational learning does not surely lead to the change in behavior.
es_es: El tercer concepto de Bandura afirma que el aprendizaje mediante la observación no conduce con seguridad al cambio de comportamiento.

source: The third model entails elucidation and depiction of different actions.
es_es: El tercer modelo implica la elucidación y representación de distintas acciones.

source: The two scholars noted further that girls would be dissatisfied more with their bodies if mothers or close friends encouraged them to lose weight.
es_es: Los dos académicos señalaron, además, que las chicas estarían más insatisfechas con su cuerpo si las madres o las amigas íntimas las animaran a adelgazar.

source: Their assessment indicated that two thirds of both boys and girls considered thin believe body proportions are a substantial factor influencing their lives.
es_es: Su evaluación indicó que dos tercios de los chicos y chicas considerados delgados creen que las proporciones corporales son un factor sustancial que influye en sus vidas.

source: Their findings revealed that most of the media content is focused on emphasizing physical beauty as a symbol of success.
es_es: Sus conclusiones revelaron que la mayor parte del contenido de los medios de comunicación se centra en destacar la belleza física como símbolo de éxito.

source: Their perfect body proportions are seen on television, magazines, advertising, etc.
es_es: Sus proporciones corporales perfectas se ven en la televisión, las revistas, la publicidad, etc.

source: There is a vast amount of publications discussing whether media influences kids’ perception of beauty and society and their behavioral traits or not.
es_es: Existe una gran cantidad de publicaciones que debaten si los medios de comunicación influyen o no en la percepción que tienen los niños de la belleza y la sociedad y, en sus rasgos de comportamiento.

source: There is a wide range of TV shows and programs dedicated to the clarification of female’s roles in the contemporary society.
es_es: Existe una amplia gama de programas de televisión dedicados a la aclaración del papel de la mujer en la sociedad contemporánea.

source: There is a wide range of media resources present and available in the modern life.
es_es: En la vida moderna existe una amplia gama de medios de comunicación.
